app/controllers/folders_controller.rb

  def index

    @folders = Folder.all
---
SELECT "folders".* FROM "folders"

  def create
    @folder = Folder.new(folder_params)

    respond_to do |format|
      if @folder.save
---
INSERT INTO "folders" ("title", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Parent"], ["parent_id", 1], ["created_at", "2015-12-28 22:47:07.896695"], ["updated_at", "2015-12-28 22:47:07.896695"]]

    def set_folder
      @folder = Folder.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT 1  [["id", 1]]