app/controllers/links_controller.rb

  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("medium_id", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["medium_id", 1], ["folder_id", 1], ["created_at", "2015-12-25 21:59:19.263690"], ["updated_at", "2015-12-25 21:59:19.263690"]]