app/controllers/pages_controller.rb

  def home
    unc_url = "http://0.0.0.0:3000/"
    unc_base = "STORAGE/"
    unc_letter = "A/"

    if params[:current_medium_id].nil?
    current_medium_id = "0"
    else
    current_medium_id = params[:current_medium_id]
    end

    if params[:current_link_id].nil?
    @current_link_id = "0"
    else
    @current_link_id = params[:current_link_id]
    end

	  if params[:current_folder_id].nil?
		  @links = Link.all.where(folder_id: nil)
      @folders = Folder.all.where(parent_id: nil)
      @media = Medium.all.where(id: 0)
      @current_thumb_path = "0"
      @current_media_path = "0"
      @metadata = Metadatum.all.where(id: 0)
      @technicals = Technical.all.where(id: 0)
---
SELECT "technicals".* FROM "technicals" WHERE "technicals"."medium_id" = $1  [["medium_id", 1]]