app/controllers/sorts_controller.rb

  def index
    @sorts = Sort.all
---
SELECT "sorts".* FROM "sorts"

  def create
    @sort = Sort.new(sort_params)

    respond_to do |format|
      if @sort.save
---
INSERT INTO "sorts" ("title", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Video"], ["icon", "video.png"], ["created_at", "2015-12-23 23:11:05.430651"], ["updated_at", "2015-12-23 23:11:05.430651"]]

  def update
    respond_to do |format|
      if @sort.update(sort_params)
---
UPDATE "sorts" SET "icon" = $1, "updated_at" = $2 WHERE "sorts"."id" = $3  [["icon", "fa-film"], ["updated_at", "2015-12-27 22:39:46.995402"], ["id", 1]]

    def set_sort
      @sort = Sort.find(params[:id])
---
SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = $1 LIMIT 1  [["id", 1]]