app/controllers/states_controller.rb

INSERT INTO "states" ("title", "bd_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Online"], ["bd_color", "#c52b2b"], ["created_at", "2015-12-27 23:03:23.424541"], ["updated_at", "2015-12-27 23:03:23.424541"]]
---
  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save

UPDATE "states" SET "bd_color" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["bd_color", "#4fc52b"], ["updated_at", "2015-12-27 23:03:55.304266"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @state.update(state_params)

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_state
      @state = State.find(params[:id])