app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("title", "bg_color", "bd_color", "tx_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Feed"], ["bg_color", "#000000"], ["bd_color", "#000000"], ["tx_color", "#FFFFFF"], ["created_at", "2015-12-23 17:14:48.983358"], ["updated_at", "2015-12-23 17:14:48.983358"]]

  def update
    respond_to do |format|
      if @tag.update(tag_params)
---
UPDATE "tags" SET "bd_color" = $1, "tx_color" = $2, "updated_at" = $3 WHERE "tags"."id" = $4  [["bd_color", "#000000"], ["tx_color", "#FFFFFF"], ["updated_at", "2015-12-27 23:47:06.742896"], ["id", 2]]