app/controllers/technicals_controller.rb

  def index
    @technicals = Technical.all
---
SELECT "technicals".* FROM "technicals"

    def set_technical
      @technical = Technical.find(params[:id])
---
SELECT  "technicals".* FROM "technicals" WHERE "technicals"."id" = $1 LIMIT 1  [["id", 1]]