app/controllers/workflows_controller.rb

  def index
    @workflows = Workflow.all
---
SELECT "workflows".* FROM "workflows"